Revit 2026 API

# InCanvasControlDataPosition Property

---

The position of the in-canvas control in model coordinates.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ Position { get; set; }
```
```vb
Public Property Position As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ Position {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member Position : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

InCanvasControlData Class

Autodesk.Revit.DB Namespace